tutorials/Blasius/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0.0 0.0 0.005)
    (1 0.0 0.005)
    (1 0.0 -0.005)
    (0.0 0.0 -0.005)
    (0.0 0.01 0.005)
    (1 0.01 0.005)
    (1 0.01 -0.005)
    (0.0 0.01 -0.005)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (50 1 50) simpleGrading (1 1 10)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 4 7 3)
    )
    patch outlet 
    (
        (1 2 6 5)
    )
    symmetryPlane bottom 
    (
        (0 3 2 1)
    )
    symmetryPlane top 
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
