tutorials/Blasius/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/giulio/OpenFOAM/giulio-1.4.1/run/TESTViscous";
    case "Blasius";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
inlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 50;
    startFace 4900;
}

outlet
{
    type patch;
    physicalType extrapolatedOutlet;
    nFaces 50;
    startFace 4950;
}

bottom
{
    type patch;
    physicalType viscousAdiabaticWall;
    nFaces 50;
    startFace 5000;
}

top
{
    type patch;
    physicalType extrapolatedOutlet;
    nFaces 50;
    startFace 5050;
}

defaultFaces
{
    type empty;
    nFaces 5000;
    startFace 5100;
}
)

// ************************************************************************* //
